
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/109naoki/rss-infra/actions/runs/8414677573)



<pre><code>Apply complete! Resources: 2 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-091f21a54fc911aba]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-0ff4b7cf67029f0dd]
aws_security_group.ecs: Refreshing state... [id=sg-0c52d53b99ba37ca7]
aws_security_group.alb: Refreshing state... [id=sg-02ec66d913b4fb6e9]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-08f057da2c1e6f29b]
aws_lb_target_group.alb_target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:273001585891:targetgroup/go-rss-server-target-group/a223748d09ac38bc]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-023ebf38354652734]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-035cfa7d06994e758]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0559881d84db86322]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-07d1d80f0ed6bb932]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-046d00b4612d31901]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-048af904a6d32cb40]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0f0375cca0d460ec1]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-019a1aa7d4f2158c2]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0a8fdfa87f1df4d2c]
aws_security_group_rule.ecs_from_alb: Refreshing state... [id=sgrule-2882790752]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-07591b3e6fbcf480f]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0559881d84db863221080289494]
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-0f6bab745980dd060]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-07e39ac159916c26b]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0b8866ccab1204bb6]
aws_lb.alb: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:273001585891:loadbalancer/app/go-rss-server-alb/9c21f6c7b0c4b8de]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0c1514818bf88c6c9]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0654f69cb494833ec]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-028455c38671132b7]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-0171619a4015cf390]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-046d00b4612d319011080289494]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-07d1d80f0ed6bb9321080289494]
aws_lb_listener.alb_listener: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:273001585891:listener/app/go-rss-server-alb/9c21f6c7b0c4b8de/af8b4fae608060c0]
aws_lb_listener_rule.alb_listener_rule: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:273001585891:listener-rule/app/go-rss-server-alb/9c21f6c7b0c4b8de/af8b4fae608060c0/bb66fce5d939d399]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_ecr_lifecycle_policy.ecr_lifecycle_policy will be created
  + resource "aws_ecr_lifecycle_policy" "ecr_lifecycle_policy" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep last 30 images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber = 30
                          + countType   = "imageCountMoreThan"
                          + tagStatus   = "any"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "go-rss-server"
    }

  # aws_ecr_repository.ecr_repository will be created
  + resource "aws_ecr_repository" "ecr_repository" {
      + arn                  = (known after apply)
      + force_delete         = true
      + id                   = (known after apply)
      + image_tag_mutability = "IMMUTABLE"
      + name                 = "go-rss-server"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.
aws_ecr_repository.ecr_repository: Creating...
aws_ecr_repository.ecr_repository: Creation complete after 0s [id=go-rss-server]
aws_ecr_lifecycle_policy.ecr_lifecycle_policy: Creating...
aws_ecr_lifecycle_policy.ecr_lifecycle_policy: Creation complete after 0s [id=go-rss-server]

Apply complete! Resources: 2 added, 0 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":4,"Program":"tfcmt","SHA1":"167e637cd2f30bdd0011f72abffd63929148da5e","Vars":{},"WorkflowName":"Terraform"} -->